# Pandas
## Combining Datasets: Concat and Append

In [51]:
import numpy as np
import pandas as pd

**Function to create a dataframe with dummy data**

In [52]:
def make_df(cols, ind): 
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

df3 = make_df('AB', [3, 4])
df3

    A   B
3  A3  B3
4  A4  B4

In [54]:
df4 = make_df('CD', [3, 4])
df4

    C   D
3  C3  D3
4  C4  D4

**Conatenation along rows
Note that Pandas concatenation preserves indices, even if the result will have duplicate indices**

In [56]:
pd.concat([df3, df4])

     A    B    C    D
3   A3   B3  NaN  NaN
4   A4   B4  NaN  NaN
3  NaN  NaN   C3   D3
4  NaN  NaN   C4   D4

**Conatenation along columns**

In [58]:
pd.concat([df3, df4], axis=1)

    A   B   C   D
3  A3  B3  C3  D3
4  A4  B4  C4  D4

**Catch repeated indices whle concatenating with verify_integrity**

In [60]:
try:
    pd.concat([df3, df4], verify_integrity=True)
except ValueError as e: 
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([3, 4], dtype='int64')

**Ignore indexes and reset them**

In [64]:
pd.concat([df3, df4], ignore_index=True)

     A    B    C    D
0   A3   B3  NaN  NaN
1   A4   B4  NaN  NaN
2  NaN  NaN   C3   D3
3  NaN  NaN   C4   D4

**Adding MultiIndex keys**

In [66]:
pd.concat([df3, df4], keys=['df3', 'df4'])

         A    B    C    D
df3 3   A3   B3  NaN  NaN
    4   A4   B4  NaN  NaN
df4 3  NaN  NaN   C3   D3
    4  NaN  NaN   C4   D4

**Joins**

In [68]:
df5 = make_df('ABC', [1, 2]) 
df6 = make_df('BCD', [3, 4])
df7 =  make_df('DEF', [1, 3])

print(pd.concat([df5, df6]))

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

**Inner Join, along rows we select matching columns only**

In [69]:
pd.concat([df5, df6], join='inner')

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [71]:
pd.concat([df5, df7], axis=1)

     A    B    C    D    E    F
1   A1   B1   C1   D1   E1   F1
2   A2   B2   C2  NaN  NaN  NaN
3  NaN  NaN  NaN   D3   E3   F3

**Along columns we select matching rows only**

In [73]:
pd.concat([df5, df7], join='inner', axis=1)

    A   B   C   D   E   F
1  A1  B1  C1  D1  E1  F1

**Specify resulting columns on a join**
**Join df5 and df6 (along rows) and return columns of df5**

In [41]:
pd.concat([df5, df6], join_axes=[df5.columns])

**Many-to-many / Many-to-one Joins (Similar to left join)**

In [76]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
'group': ['Accounting', 'Engineering', 'Engineering', 'HR']}) 

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
'hire_date': [2004, 2008, 2012, 2014]})

df3 = pd.merge(df1, df2)


df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'], 'supervisor': ['Carly', 'Guido', 'Steve']})

In [77]:
print(df3)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [78]:
print(df4)

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

**Many-to-one joins are joins in which one of the two key columns contains duplicate entries. For the many-to-one case, 
the resulting DataFrame will preserve those dupli‚Äê cate entries as appropriate**

In [79]:
print(pd.merge(df3, df4))

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

**Many-to-many joins.
If the key column in both the left and right array contains duplicates, then the result is a many-to-many merge.**

In [80]:
df5 = pd.DataFrame({'area': ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
                     'skills': ['math', 'spreadsheets', 'coding', 'linux',
                                      'spreadsheets', 'organization']})
print(df1)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [81]:
print(df5)

          area        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

**Use left_on / right_on to specify join columns when the names don't match**

In [82]:
print(pd.merge(df1, df5, left_on="group", right_on="area"))

  employee        group         area        skills
0      Bob   Accounting   Accounting          math
1      Bob   Accounting   Accounting  spreadsheets
2     Jake  Engineering  Engineering        coding
3     Jake  Engineering  Engineering         linux
4     Lisa  Engineering  Engineering        coding
5     Lisa  Engineering  Engineering         linux
6      Sue           HR           HR  spreadsheets
7      Sue           HR           HR  organization

**use drop wih axis 1 to drop the chosen redundant column**

In [49]:
print(pd.merge(df1, df5, left_on="group", right_on="area").drop("area", axis=1))

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization